# TooManyElementsToCheckout Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..TooManyElementsToCheckout Property
BuiltInFailures..::..EditingFailures Class See Also
---
Too many elements were attempted to be marked as editable, prompt user to mark workset(s) editable instead
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TooManyElementsToCheckout { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TooManyElementsToCheckout As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TooManyElementsToCheckout {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace